# ColorBackgroundSettings Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorBackgroundSettings Class
Members See Also
---
Represents the rendering color background settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class ColorBackgroundSettings : BackgroundSettings
```

Visual Basic
---
```text
Public Class ColorBackgroundSettings _
	Inherits BackgroundSettings
```

Visual C++
---
```text
public ref class ColorBackgroundSettings : public BackgroundSettings
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BackgroundSettings Autodesk.Revit.DB..::..ColorBackgroundSettings
# See Also
ColorBackgroundSettings Members
Autodesk.Revit.DB Namespace